Revit 2027 API
BuiltInFailures.PipingFailures.DuctPipeModified Property
 The duct/pipe has been modified to be in the opposite direction causing the connections to be invalid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DuctPipeModified { get; }
Public Shared ReadOnly Property DuctPipeModified As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DuctPipeModified {
	FailureDefinitionId^ get ();
}
static member DuctPipeModified : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PipingFailures Class
Autodesk.Revit.DB Namespace